'''
    现在魔法学院有赫敏、哈利、罗恩、马尔福四个人的几次魔法作业的成绩。
    但是呢，因为有些魔法作业有一定难度，教授不强制同学们必须上交，
    所以大家上交作业的次数并不一致。
    [罗恩, 23 ,35 ,44]
    [哈利 ,60, 77 ,68 ,88, 90]
    [赫敏, 97 ,99 ,89 ,91, 95, 90]
    [马尔福 ,100, 85 ,90]
    求每个人的总成绩？
'''
grade=[
        ["罗恩", 23 ,35 ,44],
        ["哈利" ,60, 77 ,68 ,88, 90],
        ["赫敏", 97 ,99 ,89 ,91, 95, 90],
        ["马尔福" ,100, 85 ,90]
    ]

for i in grade:
    allgrade=0
    for j in range(1,len(i)):
        allgrade += i[j]
    print("%s的总成绩为：%d"%(i[0],allgrade))